app/controllers/customers_controller.rb

SELECT "customers".* FROM "customers" ORDER BY "customers"."full_name" ASC
---
  def alphabetized
    @customers = Customer.order(:full_name)

SELECT "customers".* FROM "customers" WHERE ("customers"."email" = ? OR "customers"."email" IS NULL)  [["email", "[FILTERED]"]]
---
  def missing_email
    @customers = Customer.where(email: [nil, ""])